// საკლასო დავალება:

// შექმენით ფუნქცია, რომელსაც ერთი სთრინგი გადაეცემა. ამ ფუნქციამ უნდა დააბრუნოს promise. თუ სთრინგის სიგრძე ლუწია, promise-მა უნდა მოახდინოს resolve და მისი არგუმენტი იყოს თვითონ სთრინგი. ხოლო, თუ სთრინგის სიგრძე კენტია, promise-მა უნდა მოახდინოს reject და არგუმენტად ისევ სთრინგი გადაეცით. 

// ფუნქცია უნდა იყოს ასინქრონული, ამიტომ მასში ჩააშენეთ setTimeout და დროს იყოს 2 წამი.

// გამოიძახეთ Promise.all მეთოდი, მას არგუმენტად გადაეცით მასივი, სადაც იქნება 3 promise თქვენს მიერ შექმნილი ფუნქციიდან. 

// Promise.all-ის მიერ დაბრუნებულ promise-ზე უნდა გაწეროთ როგორც then მეთოდი, ასევე catch მეთოდი. ორივე მეთოდში დაბეჭდეთ დაბრუნებული ინფორმაცია.
const prom = str => {
    return new Promise((resolve,reject) => {
        setTimeout(() => {
            if (str.length%2 === 0) {
                resolve(str)
            } else {
                reject(str)
            }
        },2000)
    })
}
Promise.all([prom("hello"),prom("good"),prom("cat")])
    .then(p1 => console.log(p1))
    .catch(p1 => console.log(p1))


// საკლასო დავალება:

// შედით მოცემულ საიტზე, აირჩიეთ ნებისმიერი ლინკი. შემდეგ, js-ის ფაილში გამოიძახეთ fetch ფუნქცია, მას გადაეცით თქვენი ლინკი არგუმენტად და დაბრუნებული ინფორმაცია გადაიყვანეთ json ფორმატში .json() მეთოდის გამოყენებით. საბოლოოდ კი დაბეჭდეთ ეს ინფორმაცია.

// https://goa-api.vercel.app/

fetch('https://goa-api.onrender.com/mentors/speed_count')
    .then(res => res.json())
    .then(json => console.log(json));